app/Controllers/Users.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->paginate(10);
---
SELECT *
FROM `users`
WHERE `nama` LIKE '%ahmad%' ESCAPE '!'
AND `role` = 'admin'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `nama` LIKE '%ahmad%' ESCAPE '!'
AND `role` = 'admin'

    public function edit($id)
    {
        $data['user'] = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '0'

    public function update($id)
    {
        $user = $this->users->find($id);  // Ambil data user lama
---
SELECT *
FROM `users`
WHERE `users`.`id` = '0'

            $data['password'] = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
        }

        $this->users->update($id, $data);
---
UPDATE `users` SET `nama` = 'root', `email` = 'root@gmail.com', `username` = 'root', `role` = 'admin', `foto` = 'root.jpg', `password` = '$2y$10$cVlz8QvTT8Azyhd.sH3x.OONhuP2JtR3dDto3dQWW/0h5MqQYXeJS'
WHERE `users`.`id` IN ('0')

    public function detail($id)
    {
        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '0'

    public function print()
    {
        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->findAll();
---
SELECT *
FROM `users`
WHERE `nama` LIKE '%ahmad%' ESCAPE '!'
AND `role` = 'admin'

    public function wa($id)
    {
        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'